zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507z(e-c)xx-pinctrl.h
/* TIMER2_CH0 */
#define TIMER2_CH0_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH0_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_INP_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH0_PB4_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_INP_PRMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH0_PB4_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH0_PC6_INP_FRMP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH0_PC6_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_INP_PRMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH1_PB5_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH1_PC6_INP_NORMP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PC6_OUT_NORMP \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PC7_INP_NORMP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PC7_OUT_NORMP \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PC7_INP_FRMP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH1_PC7_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0_INP_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH2_PB0_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PB0_INP_PRMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH2_PB0_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH2_PC8_INP_NORMP \
	GD32_PINMUX_AFIO('C', 8, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH2_PC8_OUT_NORMP \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PC8_INP_FRMP \
	GD32_PINMUX_AFIO('C', 8, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH2_PC8_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1_INP_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH3_PB1_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PB1_INP_PRMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH3_PB1_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH3_PC9_INP_NORMP \
	GD32_PINMUX_AFIO('C', 9, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH3_PC9_OUT_NORMP \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PC9_INP_FRMP \
	GD32_PINMUX_AFIO('C', 9, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH3_PC9_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, TIMER2_FRMP)

/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6_INP_NORMP \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH0_PB6_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH0_PD12_INP_NORMP \
	GD32_PINMUX_AFIO('D', 12, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH0_PD12_OUT_NORMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH0_PD12_INP_RMP \
	GD32_PINMUX_AFIO('D', 12, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH0_PD12_OUT_RMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7_INP_NORMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH1_PB7_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH1_PD13_INP_NORMP \
	GD32_PINMUX_AFIO('D', 13, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH1_PD13_OUT_NORMP \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH1_PD13_INP_RMP \
	GD32_PINMUX_AFIO('D', 13, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH1_PD13_OUT_RMP \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8_INP_NORMP \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH2_PB8_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH2_PD14_INP_NORMP \
	GD32_PINMUX_AFIO('D', 14, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH2_PD14_OUT_NORMP \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH2_PD14_INP_RMP \
	GD32_PINMUX_AFIO('D', 14, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH2_PD14_OUT_RMP \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH3 */
#define TIMER3_CH3_PD15_INP_NORMP \
	GD32_PINMUX_AFIO('D', 15, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH3_PD15_OUT_NORMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH3_PD15_INP_RMP \
	GD32_PINMUX_AFIO('D', 15, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH3_PD15_OUT_RMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, TIMER3_RMP)
#define TIMER3_CH3_PB9_INP_NORMP \
	GD32_PINMUX_AFIO('B', 9, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH3_PB9_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, TIMER3_NORMP)

/* TIMER3_ETI */
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AFIO('E', 0, GPIO_IN, NORMP)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0_INP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
#define TIMER4_CH0_PA0_OUT \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, NORMP)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1_INP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)
#define TIMER4_CH1_PA1_OUT \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2_INP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)
#define TIMER4_CH2_PA2_OUT \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3_INP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, NORMP)
#define TIMER4_CH3_PA3_OUT \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)

